import styles from './productData.module.scss'

const TestData = [
  {
    id: '274625',
    category: 'кухня',
    name: 'Milena',
    colors: ['#F5AE6B', '#B5B2B2', '#1D1A82', '#226617', '#701F1F', '#2F2E2E'],
    price: '30 750',
    image: [
      'images/catalog/Image1.jpg',
      'images/catalog/Image2.jpg',
      'images/catalog/Image3.jpg',
      'images/catalog/Image4.jpg',
      'images/catalog/Image5.jpg',
    ],
    description:
      'Це втілення сучасного дизайну та функціональності. Вона пропонує вам безліч можливостей для створення ідеального кухонного простору, який буде відповідати вашим унікальним потребам та стилю життя. Завдяки своїй модульній конструкції, кухня "Мilena" дозволяє вам вільно вибирати та комбінувати різноманітні модулі, включаючи шафки, полички, висувні ящики та стільниці, щоб створити оптимальну композицію для вашої кухні. Надійні матеріали, які використані в кухні "Мilena", забезпечують тривалу експлуатацію. Її стильний дизайн із чистими лініями, гладкими поверхнями та мінімалістичними деталями додадуть сучасності та елегантності вашому інтерєру.З кухнею "Мilena" ви отримуєте не просто функціональне',
    characteristics:
      'Модульна кухня "Мilena" привносить сучасний стиль та елегантність у ваш простір. З її дизайном, гармонійно поєднується чистота ліній, витонченість форм, а також використання високоякісних матеріалів. Кухня "Мilena" вражає своєю функціональністю та сучасністю. Її мінімалістичний дизайн створює відчуття простору та легкості. Чисті лінії і гладкі поверхні створюють візуальний ефект безперервності і гармонії.',
  },
  {
    id: '274626',
    category: 'кухня',
    name: 'Megan',
    colors: ['#F5AE6B', '#B5B2B2', '#1D1A82', '#226617', '#701F1F', '#2F2E2E'],
    price: '38 750',
    image: [
      'images/catalog/Image1.jpg',
      'images/catalog/Image2.jpg',
      'images/catalog/Image3.jpg',
      'images/catalog/Image4.jpg',
      'images/catalog/Image5.jpg',
    ],
    description:
      'Це втілення сучасного дизайну та функціональності. Вона пропонує вам безліч можливостей для створення ідеального кухонного простору, який буде відповідати вашим унікальним потребам та стилю життя. Завдяки своїй модульній конструкції, кухня "Мilena" дозволяє вам вільно вибирати та комбінувати різноманітні модулі, включаючи шафки, полички, висувні ящики та стільниці, щоб створити оптимальну композицію для вашої кухні. Надійні матеріали, які використані в кухні "Мilena", забезпечують тривалу експлуатацію. Її стильний дизайн із чистими лініями, гладкими поверхнями та мінімалістичними деталями додадуть сучасності та елегантності вашому інтерєру.З кухнею "Мilena" ви отримуєте не просто функціональне',
    characteristics:
      'Модульна кухня "Megan" привносить сучасний стиль та елегантність у ваш простір. З її дизайном, гармонійно поєднується чистота ліній, витонченість форм, а також використання високоякісних матеріалів. Кухня "Мilena" вражає своєю функціональністю та сучасністю. Її мінімалістичний дизайн створює відчуття простору та легкості. Чисті лінії і гладкі поверхні створюють візуальний ефект безперервності і гармонії.',
  },
  {
    id: '274627',
    category: 'кухня',
    name: 'Rio',
    colors: ['#F5AE6B', '#B5B2B2', '#1D1A82', '#226617', '#701F1F', '#2F2E2E'],
    price: '35 750',
    image: [
      'images/catalog/Image1.jpg',
      'images/catalog/Image2.jpg',
      'images/catalog/Image3.jpg',
      'images/catalog/Image4.jpg',
      'images/catalog/Image5.jpg',
    ],
    description:
      'Це втілення сучасного дизайну та функціональності. Вона пропонує вам безліч можливостей для створення ідеального кухонного простору, який буде відповідати вашим унікальним потребам та стилю життя. Завдяки своїй модульній конструкції, кухня "Мilena" дозволяє вам вільно вибирати та комбінувати різноманітні модулі, включаючи шафки, полички, висувні ящики та стільниці, щоб створити оптимальну композицію для вашої кухні. Надійні матеріали, які використані в кухні "Мilena", забезпечують тривалу експлуатацію. Її стильний дизайн із чистими лініями, гладкими поверхнями та мінімалістичними деталями додадуть сучасності та елегантності вашому інтерєру.З кухнею "Мilena" ви отримуєте не просто функціональне',
    characteristics:
      'Модульна кухня "Megan" привносить сучасний стиль та елегантність у ваш простір. З її дизайном, гармонійно поєднується чистота ліній, витонченість форм, а також використання високоякісних матеріалів. Кухня "Мilena" вражає своєю функціональністю та сучасністю. Її мінімалістичний дизайн створює відчуття простору та легкості. Чисті лінії і гладкі поверхні створюють візуальний ефект безперервності і гармонії.',
  },
  {
    id: '274628',
    category: 'кухня',
    name: 'Milano',
    colors: ['#F5AE6B', '#B5B2B2', '#1D1A82', '#226617', '#701F1F', '#2F2E2E'],
    price: '29 750',
    image: [
      'images/catalog/Image1.jpg',
      'images/catalog/Image2.jpg',
      'images/catalog/Image3.jpg',
      'images/catalog/Image4.jpg',
      'images/catalog/Image5.jpg',
    ],
    description:
      'Це втілення сучасного дизайну та функціональності. Вона пропонує вам безліч можливостей для створення ідеального кухонного простору, який буде відповідати вашим унікальним потребам та стилю життя. Завдяки своїй модульній конструкції, кухня "Мilena" дозволяє вам вільно вибирати та комбінувати різноманітні модулі, включаючи шафки, полички, висувні ящики та стільниці, щоб створити оптимальну композицію для вашої кухні. Надійні матеріали, які використані в кухні "Мilena", забезпечують тривалу експлуатацію. Її стильний дизайн із чистими лініями, гладкими поверхнями та мінімалістичними деталями додадуть сучасності та елегантності вашому інтерєру.З кухнею "Мilena" ви отримуєте не просто функціональне',
    characteristics:
      'Модульна кухня "Megan" привносить сучасний стиль та елегантність у ваш простір. З її дизайном, гармонійно поєднується чистота ліній, витонченість форм, а також використання високоякісних матеріалів. Кухня "Мilena" вражає своєю функціональністю та сучасністю. Її мінімалістичний дизайн створює відчуття простору та легкості. Чисті лінії і гладкі поверхні створюють візуальний ефект безперервності і гармонії.',
  },
];


export const getObjectArray=(testData)=> {
  const result = testData.map((item) => {
    return {
      id: item.id,
      category: item.category,
      name: item.name,
      colors: item.colors,
      price: item.price,
      image: item.image,
      description: item.description,
      characteristics: item.characteristics,
    };
  });

  return result;
}


export const FilteredCategory = ({ category }) => {
   console.log(FilteredCategory)
    const filteredData = TestData.filter(item => item.category === category);
    return (
        <div className={styles.category}>
          {/* <h2>Items in the "{category}" category:</h2> */}
          <ul className={styles.list}>
            {filteredData.map(item => (
              <li key={item.id} className={styles.item}>
                <h2>{item.name}</h2>{item.name}
                <Image src={item.image} 
                alt={item.name}
                className={styles.img}
                width={400}
                height={200}/>
              </li>
            ))}
          </ul>
        </div>
      );
    };

    export function getProductById(id) {
        return TestData.find((item) => item.id === id);
      }
